-- 创建user表如果不存在，包含mysql基础字段
CREATE TABLE IF NOT EXISTS `user`
(
    `id` bigint      NOT NULL AUTO_INCREMENT comment '主键',
    `a`  date comment '测试日期',
    `b`  datetime comment '测试时间',
    `c`  timestamp comment '测试时间戳',
    `d`  time comment '测试时间',
    `e`  year comment '测试年份',
    `f`  varchar(64) not null comment '测试字符串',
    `g`  text comment '测试文本',
    `h`  char comment '测试字符',
    `i`  tinyint(4) comment '测试布尔',
    `j`  smallint(6) comment '测试小数',
    `k`  mediumint(9) comment '测试中整数',
    `l`  int(11) comment '测试整数',
    `m`  bigint(20) comment '测试大整数',
    `n`  float comment '测试浮点数',
    `o`  double comment '测试双精度',
    `p`  decimal comment '测试数字',
    `q`  binary comment '测试二进制',
    PRIMARY KEY (`id`)
) ENGINE = InnoDB
  AUTO_INCREMENT = 1
  DEFAULT CHARSET = utf8 comment ='用户表';

-- 填充10条数据
INSERT INTO user (a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, p, q)
VALUES ('2020-01-01', '2020-01-01 00:00:00', '2020-01-01 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 0)
     , ('2020-01-02', '2020-01-02 00:00:00', '2020-01-02 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 1)
     , ('2020-01-03', '2020-01-03 00:00:00', '2020-01-03 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 0)
     , ('2020-01-04', '2020-01-04 00:00:00', '2020-01-04 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 1)
     , ('2020-01-05', '2020-01-05 00:00:00', '2020-01-05 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 0)
     , ('2020-01-06', '2020-01-06 00:00:00', '2020-01-06 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 1)
     , ('2020-01-07', '2020-01-07 00:00:00', '2020-01-07 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 0)
     , ('2020-01-08', '2020-01-08 00:00:00', '2020-01-08 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 1)
     , ('2020-01-09', '2020-01-09 00:00:00', '2020-01-09 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 0)
     , ('2020-01-10', '2020-01-10 00:00:00', '2020-01-10 00:00:00', '00:00:00', 2020, 'test', 'test', 't', 1, 1.1, 1, 1,
        1, 1.1, 1.1, 1.1, 1);